USE WebStor;
/*
Задача 1
Напишіть запит, який поверне ідентифікатор клієнта (CUST_NUM) з найбільшим кредитним лімітом (CREDIT_LIMIT).
Враховуйте ймовірність того, що одразу кілька клієнтів можуть мати однаковий кредитний ліміт.
- Використовується таблиця [dbo].[CUSTOMERS]
- Не використовуйте оператор with ties
- Результативний набір даних містить: Ідентифікатор клієнта
*/
SELECT [CUST_NUM]
FROM [dbo].[CUSTOMERS]
WHERE [CREDIT_LIMIT] = (
    SELECT MAX([CREDIT_LIMIT])
    FROM [dbo].[CUSTOMERS]
);
/*
Задача 2
Напишіть запит, що повертає список замовлень клієнта з найбільшим кредитним лімітом (CREDIT_LIMIT).
Враховуйте ймовірність того, що одразу кілька клієнтів можуть мати однаковий кредитний ліміт.
- Використовується таблиці [dbo].[CUSTOMERS], [dbo].[ORDERS]
- Не використовуйте оператор with ties
- Результативний набір даних містить: Ідентифікатор клієнта
*/
SELECT o.[CUST]
FROM [dbo].[CUSTOMERS] c
JOIN [dbo].[ORDERS] o ON c.[CUST_NUM] = o.[CUST]
WHERE c.[CREDIT_LIMIT] = (
    SELECT MAX([CREDIT_LIMIT])
    FROM [dbo].[CUSTOMERS]
);
/*
Задача 3
Напишіть запит, що повертає найновіше (за датою проведення ORDER_DATE) замовлення серед списку 
замовлень клієнта з найбільшим кредитним лімітом (CREDIT_LIMIT).
Враховуйте ймовірність того, що одразу кілька замовлень можуть мати однакову дату проведення.
Враховуйте ймовірність того, що одразу кілька клієнтів можуть мати однаковий кредитний ліміт.
- Використовується таблиці [dbo].[CUSTOMERS], [dbo].[ORDERS]
- Не використовуйте оператор with ties
- Результативний набір даних містить: Ідентифікатор клієнта
*/
SELECT o.[CUST]
FROM [dbo].[CUSTOMERS] c
JOIN [dbo].[ORDERS] o ON c.[CUST_NUM] = o.[CUST]
WHERE c.[CREDIT_LIMIT] = (
    SELECT MAX([CREDIT_LIMIT])
    FROM [dbo].[CUSTOMERS]
)
ORDER BY o.[ORDER_DATE] DESC;