/*
Напишемо запит, який поверне ідентифікатор клієнта (CUST_NUM) з найбільшим кредитним лімітом (CREDIT_LIMIT).
Врахуємо ймовірність того, що одразу кілька клієнтів можуть мати однаковий кредитний ліміт.
-Використовується таблиця [dbo].[CUSTOMERS];
-Не використовується оператор with ties;
-Результативний набір даних міститиме: Ідентифікатор клієнта.
*/
--Виконання завдання:
SELECT TOP 1 CUST_NUM
FROM [dbo].[CUSTOMERS]
ORDER BY CREDIT_LIMIT DESC;
--Завдання виконано.

/*
Напишемо запит, що повертає список замовлень клієнта з найбільшим кредитним лімітом (CREDIT_LIMIT).
Врахуємо ймовірність того, що одразу кілька клієнтів можуть мати однаковий кредитний ліміт.
-Використовується таблиці [dbo].[CUSTOMERS], [dbo].[ORDERS];
-Не використовується оператор with ties;
-Результативний набір даних міститиме: Ідентифікатор клієнта.
*/
--Виконання завдання:
SELECT 
    C.CUST_NUM,
    O.ORDER_NUM
FROM [dbo].[CUSTOMERS] C
INNER JOIN [dbo].[ORDERS] O ON C.CUST_NUM = O.CUST
WHERE C.CREDIT_LIMIT = (SELECT MAX(CREDIT_LIMIT) FROM [dbo].[CUSTOMERS]);
--Завдання виконано.

/*
Напишемо запит, що повертає найновіше (за датою проведення ORDER_DATE) замовлення серед списку замовлень клієнта з найбільшим кредитним лімітом (CREDIT_LIMIT).
Врахуємо ймовірність того, що одразу кілька замовлень можуть мати однакову дату проведення.
Врахуємо ймовірність того, що одразу кілька клієнтів можуть мати однаковий кредитний ліміт.
-Використовуються таблиці [dbo].[CUSTOMERS], [dbo].[ORDERS];
-Не використовується оператор with ties;
-Результативний набір даних містить: Ідентифікатор клієнта.
*/
--Виконання завдання:
SELECT TOP 1 o.CUST
FROM [dbo].[ORDERS] o
JOIN [dbo].[CUSTOMERS] c ON o.CUST = c.CUST_NUM
WHERE c.CREDIT_LIMIT = (
    SELECT MAX(CREDIT_LIMIT)
    FROM [dbo].[CUSTOMERS]
)
ORDER BY o.ORDER_DATE DESC;
--Завдання виконано.