USE WebStor;
/*
Задача 1
Напишіть запит, який поверне дані продукту з найбільшою довжиною (за кількістю символів) опису.
Враховуйте ймовірність того, що одразу кілька товарів можуть мати однакову кількість символів в описі.
- Використовується таблиця [dbo].[PRODUCTS]
- Застосуйте строкову функцію `LEN`
- Результируючий набір даних містить: Ідент. виробника, ідент. продукту, опис продукту, довжину опису.
*/
SELECT TOP 1 WITH TIES
                  [MFR_ID],
				  [PRODUCT_ID],
				  [DESCRIPTION],
				  LEN ([DESCRIPTION]) AS "Description_length"
FROM [dbo].[PRODUCTS]
GROUP BY [MFR_ID], [PRODUCT_ID], [DESCRIPTION]
ORDER BY "Description_length" DESC;
/*
Задача 2
Напишіть запит, що повертає дані продуктів, ідентифікатор яких містить лише цифри.
Склейте значення стовпців (конкатенація): MFR_ID, PRODUCT_ID, [DESCRIPTION]. Врахуйте, що між значеннями стовпців 
має бути лише один пробіл. При необхідності видаліть хвостові пробіли.
Порахуйте кількість символів у сконкатенованому рядку. Видаліть дублюючі рядки у результуючому наборі даних.
- Використовується таблиця [dbo].[PRODUCTS]
- Застосуйте предикат `NOT LIKE`
- Застосуйте строкові функції: `CONCAT_WS`, `UPPER`, `LEN`, `RTRIM`
- Результируючий набір даних містить: сконкатенований рядок, довжина сконкатенованого рядка
- Відсортуйте результируючий набір даних за довжиною сконкатенованого рядка (за зменшенням)
*/
SELECT 
      UPPER (CONCAT_WS (' ', [MFR_ID], [PRODUCT_ID], RTRIM([DESCRIPTION]))) AS ConcatenatedString,
	  LEN (UPPER (CONCAT_WS (' ', [MFR_ID], [PRODUCT_ID], RTRIM([DESCRIPTION])))) AS String_length
FROM [dbo].[PRODUCTS]
WHERE [PRODUCT_ID] NOT LIKE '%[^0-9]%'
GROUP BY
    [MFR_ID], [PRODUCT_ID], RTRIM([DESCRIPTION])
ORDER BY [String_length] DESC;
/*
Задача 3
Напишіть запит, який поверне список клієнтів з найменшим кредитним лімітом.
Враховуйте ймовірність того, що одразу кілька клієнтів можуть мати однаковий кредитний ліміт.
Результируючий набір даних містить: ідент. клієнта, найменування клієнта, кредитний ліміт.
Найменування клієнта необхідно відобразити як 2 букви на початку рядка і 2 букви в кінці рядка, всі інші букви замінити на символ *.
- Використовується таблиця [dbo].[CUSTOMERS]
*/
SELECT TOP 1 WITH TIES
                  [CUST_NUM],
				  SUBSTRING ([COMPANY], 1, 2) + '***' + RIGHT ([COMPANY], 2) AS Customer_Name,
				  [CREDIT_LIMIT]
FROM [dbo].[CUSTOMERS]
ORDER BY [CREDIT_LIMIT] ASC;