USE WebStor;

/* Задача 1
Напишіть запит, який поверне дані продукту з найбільшою довжиною (за кількістю символів) опису. 
Враховуйте ймовірність того, що одразу кілька товарів можуть мати однакову кількість символів в описі.
- Використовується таблиця [dbo].[PRODUCTS]
- Застосуйте строкову функцію `LEN`
- Результируючий набір даних містить: Ідент. виробника, ідент. продукту, опис продукту, довжину опису.
*/
SELECT * FROM [dbo].[PRODUCTS];


SELECT TOP (1) [MFR_ID]
    ,[PRODUCT_ID]
    ,[DESCRIPTION]
	,LEN([DESCRIPTION]) AS [Довжина опису]
FROM [dbo].[PRODUCTS]
ORDER BY LEN([DESCRIPTION]) DESC;

/* Задача 2
Напишіть запит, що повертає дані продуктів, ідентифікатор яких містить лише цифри. 
Склейте значення стовпців (конкатенація): MFR_ID, PRODUCT_ID, [DESCRIPTION]. Врахуйте, що між значеннями стовпців має бути лише один пробіл. При необхідності видаліть хвостові пробіли.
Порахуйте кількість символів у сконкатенованому рядку. Видаліть дублюючі рядки у результуючому наборі даних.
- Використовується таблиця [dbo].[PRODUCTS]
- Застосуйте предикат `NOT LIKE`
- Застосуйте строкові функції: `CONCAT_WS`, `UPPER`, `LEN`, `RTRIM`
- Результируючий набір даних містить: сконкатенований рядок, довжина сконкатенованого рядка
- Відсортуйте результируючий набір даних за довжиною сконкатенованого рядка (за зменшенням)
*/
SELECT * FROM [dbo].[PRODUCTS];


SELECT DISTINCT -- Вибираємо унікальні значення
    CONCAT_WS(' ', RTRIM([MFR_ID]), RTRIM([PRODUCT_ID]), RTRIM([DESCRIPTION])) AS [Сконкатенований рядок], -- Склеюємо значення стовпців з пробілами
    LEN(CONCAT_WS(' ', RTRIM([MFR_ID]), RTRIM([PRODUCT_ID]), RTRIM([DESCRIPTION]))) AS [Довжина сконкатенованого рядка] -- Обчислюємо довжину склеєного рядка
FROM [dbo].[PRODUCTS] -- Таблиця з продуктами
WHERE [PRODUCT_ID] NOT LIKE '%[^0-9]%' -- Перевіряємо, що ідентифікатор продукту містить лише цифри
ORDER BY [Сконкатенований рядок] DESC; -- Сортуємо за спаданням за довжиною склеєного рядка


/*Задача 3
Напишіть запит, який поверне список клієнтів з найменшим кредитним лімітом.
Враховуйте ймовірність того, що одразу кілька клієнтів можуть мати однаковий кредитний ліміт.
Результируючий набір даних містить: ідент. клієнта, найменування клієнта, кредитний ліміт.
Найменування клієнта необхідно відобразити як 2 букви на початку рядка і 2 букви в кінці рядка, всі інші букви замінити на символ *.
- Використовується таблиця [dbo].[CUSTOMERS]
*/

SELECT * FROM [dbo].[CUSTOMERS]

SELECT TOP 1 WITH TIES -- Вибираємо всі рядки з найменшим кредитним лімітом
    [CUST_NUM]
    ,LEFT([COMPANY], 2) + REPLICATE('*', LEN([COMPANY]) - 4) + RIGHT([COMPANY], 2) AS MASKED_NAME, -- Формуємо ім'я клієнта замість символів крім перших і останніх двох - '*', а також зберігаємо перші дві та останні дві літери
    [CREDIT_LIMIT]-- Кредитний ліміт
FROM    
    [dbo].[CUSTOMERS] -- Таблиця з клієнтами
ORDER BY 
    [CREDIT_LIMIT] ASC; -- Сортуємо за зростанням за кредитним лімітом