   CREATE DATABASE University;

   USE University;

-- Створюємо таблицю Students
    CREATE TABLE Students (
        StudentID INT PRIMARY KEY,
        FirstName NVARCHAR(50),
        LastName NVARCHAR(50),
        EnrollmentDate DATE
    );
   
-- Створюємо таблицю Courses
CREATE TABLE Courses (
        CourseID INT PRIMARY KEY,
        CourseName NVARCHAR(100),
        CourseDescription TEXT,
        Credits INT
    );

-- Додаєм по 3 рядки в козжну з попередніх таблиць
INSERT INTO Students (StudentID, FirstName, LastName, EnrollmentDate)
VALUES 
    (1, 'Олександр', 'Петров', '2023-09-04'),
    (2, 'Марія', 'Іваненко', '2022-09-03'),
    (3, 'Василь', 'Коваленко', '2022-10-03');

INSERT INTO Courses (CourseID, CourseName, CourseDescription, Credits)
VALUES 
    (1, 'Статистика', 'Навчальна дисципліна „Статистика” охоплює методологічні основи статистики, принципи формування та розрахунків системи соціально- економічних показників, методи вивчення існуючих закономірностей, взаємозв’язків, тенденцій у розвитку явищ та процесів. Основною метою курсу є сформувати у студентів системне уявлення про статистику як окрему науку, а відповідно основними завданнями є: розвинути сукупність знань про методи статистичного оцінювання економічних процесів та організацію системи такої оцінки, допомогти опанувати теоретичні положення теорії статистики та методику їх реалізації, навчити їх самостійно поповнювати здобуті знання в майбутньому.', '150'),
    (2, 'Маркетинг', 'Метою вивчення дисципліни «Маркетинг» є формування знань щодо базових категорій маркетингу, методологічних аспектів організації маркетингової діяльності та її пріоритетів у сучасних умовах.', '90'),
    (3, 'Філософія', 'Метою вивчення навчальної дисципліни «Філософія» є формування у студентів цілісного уявлення про специфіку філософського знання, розуміння багатоваріантності шляхів культурного і цивілізаційного поступу людства та власне ставлення до них, особливості вирішення світоглядних запитів ХХІ століття, розкриття творчої ролі філософії в сучасній культурі', '90');

	-- Зробимо перевірку, продивившись дані
	SELECT * FROM Students;
	-- Виконано №1

	SELECT * FROM Courses;
	-- Виконано №2

-- Додамо по одномо стовбцю до кожної таблиці
ALTER TABLE Students ADD Email NVARCHAR(50);

ALTER TABLE Courses ADD Department NVARCHAR(150);

-- Виконаємо перевірку
SELECT * FROM Students;

SELECT * FROM Courses;

-- Видаляємо цю базу даних
   DROP DATABASE University;