/* Задача 1
Напишіть запит, який поверне список офісів східного регіону з ціллю по продажах менше або рівної 350000.00.
- Використовується таблиця [dbo].[OFFICES]
- Результуючий набір даних містить: Ідентифікатор офісу, місто, ідентифікатор керівника офісу
*/

Select [OFFICE]
 , [CITY]
 , [MGR]
from [dbo].[OFFICES]
where [REGION] = 'Eastern' and [SALES] <= 35000
; -- таблиця пуста, бо таких офісів немає.

/* Задача 2.1
Напишіть запит, що повертає список замовлень, які були проведені не в 2008 році.
Враховуйте тільки замовлення на товари з ідентифікатором товарів (PRODUCT), які містять «A» другим символом або «0» в будь-якому місці.
- Використовується таблиця [dbo].[ORDERS]
- Задійте предикат LIKE
- Задійте предикат NOT BETWEEN
- Результуючий набір даних містить усі стовпці
*/

Select *
from [dbo].[ORDERS]
where [ORDER_DATE] not between '20080101' and '20081231'
and ([PRODUCT] like '_A%' or [PRODUCT] like '%0%')
;

/* Задача 2.2
Напишіть запит, що повертає загальну суму проведених замовлень по ідент. виробника товарів (MFR),
які були проведені не в 2008 році. Враховуйте тільки замовлення на товари з ідентифікатором товарів (PRODUCT), які містять
A другим символом або 0 в будь-якому місці.
- Використовується таблиця [dbo].[ORDERS]
- Задійте предикат LIKE
- Задійте предикат NOT BETWEEN
- Задійте агрегатну функцію SUM
- Результуючий набір даних містить: Ідент. виробника товарів, кіль-ть унікальних замовлень
- Відсортуйте результат за загальною сумою (за зростанням)
*/

Select [MFR],
count(distinct [ORDER_NUM]) as [UNIQUE_ORDERS],
sum([AMOUNT]) as [TOTAL_ORDER]
from [dbo].[ORDERS]
where [ORDER_DATE] not between '20080101' and '20081231'
and ([PRODUCT] like '_A%' or [PRODUCT] like '%0%')
group by [MFR]
order by [TOTAL_ORDER] asc;

/* Задача 2.3
Напишіть запит, що повертає ідент. виробника з найбільшою загальною сумою проведених замовлень.
Враховуйте ймовірність того, що одразу кілька виробників можуть мати одну і ту ж загальну суму.
Враховуйте тільки замовлення, які були проведені не в 2008 році.
Враховуйте тільки замовлення на товари з ідентифікатором товарів (PRODUCT), які містять
A другим символом або 0 в будь-якому місці.
- Використовується таблиця [dbo].[ORDERS]
- Задійте предикат LIKE
- Задійте предикат NOT BETWEEN
- Задійте агрегатну функцію SUM
- Задійте фільтр TOP і оператор WITH TIES
- Результуючий набір даних містить: Ідент. виробника товарів, загальна сума
*/

Select top 1 with ties [MFR], 
sum([AMOUNT]) as [TOTAL_ORDER]
from [dbo].[ORDERS]
where [ORDER_DATE] not between '20080101' and '20081231'
and ([PRODUCT] like '_A%' or [PRODUCT] like '%0%')
group by [MFR]
order by [TOTAL_ORDER] desc;

/* 
Задача 3
Напишіть запит, який поверне ідент. офісу з найбільшою кількістю працівників.
Враховуйте ймовірність того, що відразу кілька офісів можуть мати одну й ту саму кількість працівників.
Враховуйте лише працівників на посаді Sales Rep та у віці 29, 45, 48.
- Використовується таблиця [dbo].[SALESREPS]
- Задіяти предикат IN
- Задіяйте агрегатну функцію COUNT
- Задійте фільтр TOP та оператор WITH TIES
- Результуючий набір даних містить: Ідент. офісу, кількість працівників
*/

Select top 1 with ties [REP_OFFICE], 
count(*) as [EMP_COUNT]
from [dbo].[SALESREPS]
where [TITLE] = 'Sales Rep' and age in (29, 45, 48)
group by [REP_OFFICE]
order by [EMP_COUNT] desc;
