USE WebStor;

/*Задача 1
Напишіть запит, який поверне список ідентифікаторів виробників (без дублікатів).
Враховуйте тільки замовлення, що були проведені у 2008 році.
- Використовується таблиця [dbo].[ORDERS]
- Залучіть функцію Year
- Результативний набір даних містить: Ідентифікатор виробника
- Відсортуйте результативний набір даних за Ідентифікатор виробника (за зростанням)
*/

SELECT * FROM [dbo].[ORDERS];

SELECT DISTINCT [MFR]
FROM [dbo].[ORDERS]
WHERE YEAR([ORDER_DATE]) = 2008
ORDER BY [MFR] ASC;

/*Задача 2
Напишіть запит, який у розрізі кількості відпрацьованих років (математична різниця в роках) поверне кількість працівників.
- Використовується таблиця [dbo].[SALESREPS]
- Результативний набір даних містить: Кількість років, кількість працівників
- Відсортуйте результат за кількістю працівників за зменшенням
*/
SELECT * FROM [dbo].[SALESREPS];

SELECT 
      DATEDIFF(YEAR, [HIRE_DATE], GETDATE()) AS [Кількость відпрацьованих років]
	, COUNT(*) AS [Кількість працівників]
FROM [dbo].[SALESREPS]
GROUP BY DATEDIFF(YEAR, [HIRE_DATE], GETDATE())
ORDER BY [Кількість працівників] DESC;


/*Задача 3
Напишіть запит, який поверне період (рік, місяць) найму з найбільшою кількістю працівників.
Враховуйте ймовірність того, що відразу кілька періодів можуть мати однакову кількість працівників.
- Використовується таблиця [dbo].[SALESREPS]
- Залучіть функції: Year, Month
- Результативний набір даних містить: Рік найму, місяць найму, кількість найнятих працівників
*/

SELECT * FROM [dbo].[SALESREPS];

SELECT TOP (1) WITH TIES
    YEAR([HIRE_DATE]) AS [Рік найму],
    MONTH([HIRE_DATE]) AS [Місяць найму],
    COUNT(*) AS [Кількість найнятих працівників]
FROM 
    [dbo].[SALESREPS]
GROUP BY 
    YEAR([HIRE_DATE]),
    MONTH([HIRE_DATE])
ORDER BY 
    [Кількість найнятих працівників] DESC;


/*Задача 4
Напишіть запит, який у розрізі дня тижня (у строковому представленні) поверне кількість унікальних замовлень, загальну суму продаж, загальну кількість проданих од. товару (за весь час).
Враховуйте тільки замовлення, що були проведені в зимові місяці.
- Використовується таблиця [dbo].[ORDERS]
- Результативний набір даних містить: Номер дня тижня, назву дня тижня,
загальну кількість проведених замовлень, загальну суму продаж, загальну кількість проданих од. товару.
- Відсортуйте результат за днем тижня (за зростанням).
(Культура нумерації днів тижня значення не має)
*/

SELECT * FROM [dbo].[ORDERS];

SELECT 
    DATEPART(WEEKDAY, [ORDER_DATE]) AS [Номер дня тижня],
    DATENAME(WEEKDAY, [ORDER_DATE]) AS [Назва для тиджня],
    COUNT(DISTINCT [ORDER_NUM]) AS [Загальна кількість проведених замовлень],
    SUM([AMOUNT]) AS [Загальна сума продаж],
    SUM([QTY]) AS [Загальна кількість проданих од. товару]
FROM [dbo].[ORDERS]
WHERE MONTH([ORDER_DATE]) IN (12, 1, 2) -- зимові місяці
GROUP BY DATEPART(WEEKDAY, [ORDER_DATE]), DATENAME(WEEKDAY, [ORDER_DATE])
ORDER BY [Номер дня тижня] ASC;

