/*Напишемо запит, який поверне список унікальних ідентифікаторів виробників.
Врахуємо тільки замовлення з парною сумою замовлення і непарною кількістю замовлених одиниць товару.
- Використовується таблиця [dbo].[ORDERS]
- Результативний набір даних містить: ідентифікатор виробника
- Відсортувати рез. набір даних за ідентифікатором виробника
*/
--Виконання завдання:
SELECT DISTINCT O.MFR
FROM [dbo].[ORDERS] O
JOIN (
    SELECT ORDER_NUM, SUM(QTY) AS Total_Quantity
    FROM [dbo].[ORDERS]
    GROUP BY ORDER_NUM
    HAVING SUM(QTY) % 2 <> 0
) AS Odd_Quantities ON O.ORDER_NUM = Odd_Quantities.ORDER_NUM
WHERE O.AMOUNT% 2 = 0
ORDER BY O.MFR;
--Завдання виконано.

/*
Напишемо запит, який у розрізі ідентифікатора виробника товару поверне загальну вартість од. товару на складі та середню вартість од. товарів. 
Округлимо результати агрегування до 2 знаків після коми.
- Використовується таблиця [dbo].[PRODUCTS]
- Результуючий набір даних містить: ідентифікатор виробника, загальну суму, середню суму.
- Відсортувати результуючий набір даних за ідентифікатором виробника
*/
--Виконання завдання:
SELECT 
    MFR_ID,
    ROUND(SUM(QTY_ON_HAND * PRICE), 2) AS Total_Value,
    ROUND(AVG(PRICE), 2) AS Average_Value
FROM 
    [dbo].[PRODUCTS]
GROUP BY MFR_ID
ORDER BY MFR_ID;
--Завдання виконано.

/*
Напишемо запит, який поверне працівника з найбільшою мат. різницею між ціллю за продажами і сумою поточних продаж, у абсолютному вимірі. 
Округлимо результати обчислення до двох знаків після коми. Розрахуємо кількість років працівника на момент найму.
Врахуємо ймовірність того, що відразу кілька працівників можуть мати одну і ту ж різницю.
- Використовується таблиця [dbo].[SALESREPS]
*/
--Виконання завдання:
SELECT TOP 1
    ABS(QUOTA-SALES) AS Differency,
    ROUND(DATEDIFF(year, HIRE_DATE, GETDATE()) + (DATEDIFF(day, HIRE_DATE, GETDATE()) * 1.0) / 365, 2) AS Years_Worked
FROM
    [dbo].[SALESREPS]
ORDER BY  ABS(QUOTA-SALES) DESC;
--Завдання виконано.